; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Planet5 spectrograph2)
	(have_image Planet6 thermograph0)
	(have_image Planet7 thermograph1)
	(have_image Planet8 spectrograph3)
	(have_image Planet9 thermograph1)
	(have_image Star10 thermograph1)
	(have_image Star11 thermograph0)
	(have_image Planet12 spectrograph3)
	(have_image Phenomenon13 thermograph0)
	(have_image Phenomenon14 thermograph1)
	(have_image Star15 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 planet5 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet5)
   goals met: 0 of 12
5. (take_image satellite1 planet5 instrument2 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon14 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon14 instrument2 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 12
11. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 3 of 12
12. (take_image satellite1 phenomenon13 instrument2 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 4 of 12
13. (turn_to satellite0 planet12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet12)
   goals met: 3 of 12
14. (take_image satellite0 planet12 instrument0 spectrograph3)
   added: (have_image planet12 spectrograph3)
   goals met: 4 of 12
15. (turn_to satellite0 planet8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet8)
   goals met: 4 of 12
16. (take_image satellite0 planet8 instrument0 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 5 of 12
17. (turn_to satellite0 star15 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star15)
   goals met: 5 of 12
18. (take_image satellite0 star15 instrument0 spectrograph3)
   added: (have_image star15 spectrograph3)
   goals met: 6 of 12
19. (turn_to satellite0 groundstation4 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation4)
   goals met: 7 of 12
20. (turn_to satellite1 planet6 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet6)
   goals met: 7 of 12
21. (take_image satellite1 planet6 instrument2 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 8 of 12
22. (turn_to satellite1 planet7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet7)
   goals met: 8 of 12
23. (take_image satellite1 planet7 instrument2 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 9 of 12
24. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 9 of 12
25. (take_image satellite1 planet9 instrument2 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 10 of 12
26. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 10 of 12
27. (take_image satellite1 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 11 of 12
28. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 11 of 12
29. (take_image satellite1 star11 instrument2 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 12 of 12
